#+TITLE: Functional JDK 17
#+PROPERTY: header-args:java :noeval
#+PROPERTY: header-args:scala :noeval

*** Demo

This means that we can do
#+BEGIN_SRC jshell
record Point(int x, int y) {}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
var p1 = new Point(1,2)
#+END_SRC

#+RESULTS:

Use the getters:

#+BEGIN_SRC jshell
"P1 is at " + p1.x() + ", " + p1.y()
#+END_SRC

#+RESULTS:
: "P1 is at 1, 2"

Check for equality:

#+BEGIN_SRC jshell
"P1 is equal to itself: " + p1.equals(new Point(1,2))
#+END_SRC

#+RESULTS:
: "P1 is equal to itself: true"

*** Can't extend outside of what's sealed in

#+BEGIN_SRC jshell
class OtherShape implements Shape {

}
#+END_SRC

#+RESULTS:
: |  Error:
: |  class is not allowed to extend sealed class: Shape (as it is not listed in its permits clause)
: |  class OtherShape implements Shape {
: |  ^----------------------------------...

*** Java 12: Strings, expressions
#+BEGIN_SRC jshell
String day = "Tuesday";
#+END_SRC

#+RESULTS:
We can now switch on =String=, have multiple values in one branch, and return as an expression.

*Note*: The following no longer compiles with Java 13+ (which requires =yield= instead of =break=).
#+BEGIN_SRC jshell
switch(day) {
    case "Monday", "Tuesday":
        break "Week day";

    default:
        break "Unknown";
}
#+END_SRC

#+RESULTS:
: |  Error:
: |  ';' expected
: |            break "Week day";
: |                 ^
: |  Error:
: |  ';' expected
: |            break "Unknown";
: |                 ^

*** Java 12: Arrows for expressions
Instead of =break= or =yield=, arrows can be used to write a =switch= expression.

#+BEGIN_SRC jshell
switch(day) {
    case "Monday", "Tuesday" -> "Week day";
    default -> "Unknown";
}
#+END_SRC

#+RESULTS:
: "Week day"

*** Java 13: Yield instead of break
Here's the Java 13+ equivalent:

#+BEGIN_SRC jshell
switch(day) {
    case "Monday", "Tuesday":
        yield "Week day";

    default:
        yield "Unknown";
}
#+END_SRC

#+RESULTS:
: "Week day"

*** Java 17: Pattern matching objects, and guards
We can now check the type of an object, including additional constraints, right inside a =switch= case.

#+BEGIN_SRC jshell
Shape shape = new Shape.Box(10, 5)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
switch(shape) {
  case Shape.Circle c -> "It's a circle with diameter " + c.diameter();
  case Shape.Box b && b.width() == b.height() -> "It's a square of size " + b.width();
  case Shape.Box b -> "It's a box of size " + b.width() + " by " + b.height();
}
#+END_SRC

#+RESULTS:
: "It's a box of size 10 by 5"

*** Exhaustiveness check
Since we defined =Shape= as a =sealed= class, the compiler will now inform us if we forget to add a case.

#+BEGIN_SRC jshell
switch(shape) {
  case Shape.Box b && b.width() == b.height() -> "It's a square of size " + b.width();
  case Shape.Box b -> "It's a box of size " + b.width() + " by " + b.height();
}

#+END_SRC

#+RESULTS:
: |  Error:
: |  the switch expression does not cover all possible input values
: |  switch(shape) {
: |  ^--------------...

*** Case branch for null

A case branch for =null= is now allowed (but, please, don't). And =default= still doesn't handle =null= (this is unchanged).

(set this to non-null to compile the =switch= below)
#+BEGIN_SRC jshell
Object nothing = null;
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
switch (nothing) {
    case null     -> "null!";
    case String s -> "String";
    default       -> "Something else";
}
#+END_SRC

#+RESULTS:
: "null!"

*** VAVR
- [[https://docs.vavr.io/][Functional library]] for Java, focusing on immutable values
- [[https://www.javadoc.io/doc/io.vavr/vavr/latest/index.html][JavaDoc]] shows collection, control and concurrency primitives

Create an immutable sequence:
#+BEGIN_SRC jshell
Seq<Integer> seq = Vector.of(1, 2, 3)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
seq.forEach(i -> System.out.println(i))
#+END_SRC

#+RESULTS:
: 1
: 2
: 3

- All VAVR collections are /persistent data structures/, for example
  - =List= (single-linked list)
  - =Vector= (bit-mapped trie)
  - =HashMap= (hash array mapped trie)

*** Flow (connecting)
- Connecting a =Flow= to a =Source= (of compatible type) can be viewed as a =Source= (of the Flow's output type)

For example, let's hook up our =integers= source to the =intToString= flow:
#+BEGIN_SRC jshell
Source<String,NotUsed> strings = integers.via(intToString)
#+END_SRC

#+RESULTS:

In order to test, let's print the first 10 elements which that flow produces.
#+BEGIN_SRC jshell
strings.
  take(10).
  runForeach(System.out::println, system).
  toCompletableFuture().get(1, TimeUnit.SECONDS)
#+END_SRC

#+RESULTS:
#+begin_example
1
2
3
4
5
6
7
8
9
10

Done
#+end_example

*** Materialization

- Instances of graphs (=Source=, =Sink=, ...) are /descriptions/, and don't run yet
- Need to invoke =RunnableGraph.run()= (or one of the shorthands on =Source=) to actually start a stream
- Running a stream gives a /materialized value/
  + =Source<T, M>.= emits elements of type =T=, results in a value =M= when started
  + =Sink<T, M>.= consumes elements of type =T=, results in a value =M= when started
  + =RunnableGraph<M>.= results in a value =M= when started (=.run()= returns =M=)

- Now, we can construct =graph= again, but this time use the materialized value of the =sink=
  + By default, =.to()= uses the materialized value of the =source=

#+BEGIN_SRC jshell
RunnableGraph<CompletionStage<Done>> graph = strings.take(10).toMat(printStrings, (sourceMat, sinkMat) -> sinkMat)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
graph.run(system).toCompletableFuture().get(1, TimeUnit.SECONDS)
#+END_SRC

#+RESULTS:
#+begin_example
1
2
3
4
5
6
7
8
9
10

Done
#+end_example

*** Preparation

- Kafka is running locally, started from [[file:docker-compose.yml][docker-compose.yml]]

- Let's make sure we have an empty topic to play with:
#+BEGIN_SRC sh
kafkactl delete topic demo 2>/dev/null
kafkactl create topic demo
#+END_SRC

#+RESULTS:
: topic created: demo

- Akka can make use of Kafka through the [[https://doc.akka.io/docs/alpakka-kafka/current/home.html][Alpakka Kafka]] library

*** Writing to a topic

- Let's use akka's =Producer.plainSink= in a simple example

#+BEGIN_SRC jshell
void writeToTopic() throws Exception {
    final ProducerSettings<String, String> producerSettings =
        ProducerSettings.create(system, new StringSerializer(), new StringSerializer())
        .withBootstrapServers("localhost:9092");

    Source.range(1, 10)
        .map(number -> number.toString())
        .map(value -> new ProducerRecord<String, String>("demo", value))
        .runWith(Producer.plainSink(producerSettings), system)
        .toCompletableFuture().get(10, TimeUnit.SECONDS);
}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
writeToTopic()
#+END_SRC

- Let's see if they arrived:
#+BEGIN_SRC sh
kafkactl consume demo --from-beginning --exit
#+END_SRC

#+RESULTS:
|  1 |
|  2 |
|  3 |
|  4 |
|  5 |
|  6 |
|  7 |
|  8 |
|  9 |
| 10 |

*** Writing to a topic

#+BEGIN_SRC jshell
Seq<WriteResult> writeToTopic() throws Exception {
    var settings = AmqpWriteSettings.create(AmqpLocalConnectionProvider.getInstance())
        .withRoutingKey("demo-queue")
        .withDeclaration(QueueDeclaration.create("demo-queue"))
        .withBufferSize(10)
        .withConfirmationTimeout(Duration.ofMillis(200));

    return Source.range(1, 10)
        .map(number -> number.toString())
        .map(value -> WriteMessage.create(ByteString.fromString(value)))
        .via(AmqpFlow.createWithConfirm(settings))
        .runWith(Sink.seq(), system)
        .thenApply(Vector::ofAll)
        .toCompletableFuture().get(10, TimeUnit.SECONDS);

}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
writeToTopic()
#+END_SRC

#+RESULTS:
: Vector(WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true), WriteResult(confirmed=true))

*** Reading from a topic

#+BEGIN_SRC jshell
Seq<String> readFromTopic() throws Exception {
    var bufferSize = 10;
    Source<ReadResult, NotUsed> amqpSource =
        AmqpSource.atMostOnceSource(
            NamedQueueSourceSettings.create(AmqpLocalConnectionProvider.getInstance(), "demo-queue")
            .withDeclaration(QueueDeclaration.create("demo-queue"))
            .withAckRequired(false),
            bufferSize);

    return amqpSource.take(10)
        .map(readResult -> readResult.bytes().utf8String())
        .runWith(Sink.seq(), system)
        .thenApply(Vector::ofAll)
        .toCompletableFuture()
        .get(1, TimeUnit.SECONDS);
}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
readFromTopic()
#+END_SRC

#+RESULTS:
: Vector(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

